---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralF
source: html/616d2bb3-8b73-7850-4115-7f332b7c6b89.htm
---
# StructuralSectionGeneralF Members

Creates a new instance of Structural Section Flat Bar.